In [48]:
#สร้าง DataFrame จาก Dictionary

In [ ]:
#การสร้าง DataFrame จาก Dictionary
# import pandas as pd
# data = [
#     {'Name':'คีย์บอร์ด','Category':'อุปกรณ์คอม','Price':1200},
#     {'Name':'ตุ๊กตา','Category':'ของเล่น','Price':900},
#     {'Name':'i phone 12','Category':'มือถือ','Price':30000},
# ]
# #สร้าง DataFrame จาก Dictionary 
# df = pd.DataFrame(data)
# df

In [50]:
#เรียกใช้งาน pandas
import pandas as pd

In [51]:
#สร้าง กลุ่มข้อมูลแบบ  Dictionary

product = [
    {'Name':'คีย์บอร์ด','Category':'อุปกรณ์คอม','Price':1200},
    {'Name':'ตุ๊กตา','Category':'ของเล่น','Price':900},
    {'Name':'i phone 12','Category':'มือถือ','Price':30000},
]

In [52]:
#สร้าง DataFrame จาก Dictionary
df = pd.DataFrame(product)

In [53]:
#แสดง DataFrame
df

         Name    Category  Price
0   คีย์บอร์ด  อุปกรณ์คอม   1200
1      ตุ๊กตา     ของเล่น    900
2  i phone 12      มือถือ  30000

In [54]:
#อยากสร้างข้อมูลเพิ่ม
product = [
    {'Name':'คีย์บอร์ด','Category':'อุปกรณ์คอม','Price':1200},
    {'Name':'ตุ๊กตา','Category':'ของเล่น','Price':900},
    {'Name':'i phone 12','Category':'มือถือ','Price':30000},
    {'Name':'ทุเรียน','Category':'ผลไม้','Price':170}
]

In [55]:
#สร้าง DataFrame จาก Dictionary
df = pd.DataFrame(product)

In [56]:
df

         Name    Category  Price
0   คีย์บอร์ด  อุปกรณ์คอม   1200
1      ตุ๊กตา     ของเล่น    900
2  i phone 12      มือถือ  30000
3     ทุเรียน       ผลไม้    170

In [ ]:
#ถ้าเราอยากเปลี่ยน index หรือ ตำแหน่ง ที่มันแสดงผลออกมา เป็นชื่อ สินค้าแทน
df.set_index(['Name']) #อันนี้แบบชั่วคราว มันไม่เปลี่ยนถาวร
#ถ้าอยากให้เปลี่ยนถาวร หรือ save ทับอันเดิมไปเลย ให้ใช้คำสั่ง เพิ่ม df.set_index(['Name'],inplace=True)

#เรื่อง set_indexสามารถนำไปใช้กับเรื่อง list ซ้อน list หรือ คือเรื่อง list หลายมิติ

              Category  Price
Name
คีย์บอร์ด   อุปกรณ์คอม   1200
ตุ๊กตา         ของเล่น    900
i phone 12      มือถือ  30000
ทุเรียน          ผลไม้    170

In [58]:
df

         Name    Category  Price
0   คีย์บอร์ด  อุปกรณ์คอม   1200
1      ตุ๊กตา     ของเล่น    900
2  i phone 12      มือถือ  30000
3     ทุเรียน       ผลไม้    170

In [59]:
#ถ้าอยากให้เปลี่ยนถาวร หรือ save ทับอันเดิมไปเลย ให้ใช้คำสั่ง เพิ่ม df.set_index(['Name'],inplace=True) และ inplace=True คือการ save ทับ
df.set_index(['Name'],inplace=True)
df

              Category  Price
Name
คีย์บอร์ด   อุปกรณ์คอม   1200
ตุ๊กตา         ของเล่น    900
i phone 12      มือถือ  30000
ทุเรียน          ผลไม้    170

In [60]:
df #ผลลัพธ์จะเห็นว่าindexเปลี่ยนไปเป็นชื่อสิ้นค้าที่เรากำหนดแล้ว

              Category  Price
Name
คีย์บอร์ด   อุปกรณ์คอม   1200
ตุ๊กตา         ของเล่น    900
i phone 12      มือถือ  30000
ทุเรียน          ผลไม้    170